
import org.junit.platform.commons.util.StringUtils;

import java.io.*;
import java.util.Arrays;
import java.util.List;

/**
 * @ClassName CorporateTest
 * @Description TODO
 * @Author 郭丁志
 * @Date 2020-03-22 21:25
 * @Version 1.0
 */
public class CorporateTest {


    public static void main(String[] args) {
        test(2);
//        System.out.println(readrowcol(3,4));
    }

    public static void test(int col) {


        String name = "152627600042741,152634600000716,152627600027931,152627600031333,152630600008537,152626600033856,152627600021498,152626600019194,152627600043492,152627600030419,152630600012531,152627600016914,152627600027327,152627600029316,152627600026266,152626600035862,152630600000830,152627600042792,152627600026725,92150924MA0NLQ2C4B,152627600042522,152627600024906,152626600024208,152627600028983,152627600034910,152627600037951,152630600010327,152627600021764,1526273100139,152627600011687,152627600028782,152627600017659,152627600032658,152626600019983,152627600030435,152630600018706,152603600000096,152627600018112,152627600027118,152627600036305,152627600009875,1526273103330,152627600031198,152627600044063,152627600026555,152603600000107,152627600042475,152627600020157,152627600018678,1526273200974,152630600000346,152630600020349,152630600008980,152626600035887,152634600000335,152627600016955,152626600014413,152626600037157,152627600027159,1526273100458,150925600019345,152627600042830,152626600037518,152624196512260013,152626600037614,152627600024914,152626600015109,152627600023528,152627600016205,152627600043652,152627600032980,152630600024962,152627600037943,152630600010351,1526273101351,152630600010239,152627600024787,152627600037695,152630600009667,152627600029293,152627600042483,152626600034100,152630600018265,152627600025388,152630600010222,1526273101217,152627600038044,152627600036637,152627600024875,152627600028590,152627600015376,152626600025678,152627600031536,152627600011880,152630600010263,152630600009827,152630600000215,152627600035907,152626600036582,152627600042821,1526273100499,152627600033257,152627600038001,152626600018765,152627600024310,152634600005486,152627600042784,152626600024193,152627600044276,152627600037496,152627600030398,152627600038190,152627600011496,152626600029639,152630600010247,152627600028508,152627600037994,152626600009073,152627600010766,152627600032168,152626600019590,152627600015026,152627600006764,152627600044022,152603600000705,152627600011791,152627600035505,152634600044679,152630600010468,152626600036986,152627600029445,152627600031464,152627600029033,152627600032328,152627600007541,152627600020010,152626600024224,152626600034319,152627600033021,1526273103331,152627600036250,152626600009522,152627600033064,152627600016272,152626600036646,152627600028401,152627600019349,152627600004461,152627600028707,152626600019604,152626600027934,152627600035982,152626600036523,152627600042598,152627600035958,152630600004518,152627600027095,152627600027853,152630600026755,152627600013676,152627600037308,152626600028277,1526273100188,152627600029461,152626600016440,152603600000326,152626600037116,152630600007430,152630600022295,152627600029566,152627600027513,152627600030769,152627600007218,152626600033459,152627600042619,152626600036603,150926600007734,152627600013174,152627600024779,152626600024546,152627600027530,152627600030460,152627600032545,152627600017281,15260160017337,152627600029775,152627600021107,152630600021786,152627600031995,152626600015168,152626600018628,1526273100385,152627600036565,152630600005852,152627600033474,152630600010183,152627600037978,152630600020269,152630600008711,152626600014350,152627600021414,1526273102829,152630600032753,152627600037197,150902600250540,152627600034434,152630600012898,152627600042864,152630600022342,152627600037507,152627600025423,152627600042467,152630600010335,152627600018311,152627600024141,152630600010298,152630600022789,152627600023376,152627600036047,150925600004557,152627600017048,1526273103320,152626600009635,152627600010006,152627600042733,152626600046012,152626600024257,152627600033503,150926600007726,152627600042459,152630600020017,150925600019353,152627600040002,152630600008035,152630600020679,152627600025714,152627600042768,152627600020044,152627600031745,1526273100388,152627600036604,152627600035974,152626600025311,152630600008963,152630600035129,152630600010255,152627600031106,152626600009571,152627600030996,152627600042725,152626600012045,152627600042856,152626600002943,152626600036638";
        List<String> result = Arrays.asList(name.split(","));

        System.out.println(result.size());

        int ii = 0;

        try {

            File file = new File("/Users/mr.gmac/Documents/耀灵公司文档/集宁工商信息/");
            for (File listFile : file.listFiles()) {

                String quxian = listFile.getName().replace(".csv","");
                switch (quxian){
                    case "察右后旗" :
                        quxian = "察右后旗";
                        break;
                    case "察右前旗" :
                        quxian = "察右前旗";
                        break;
                    case "察右中旗" :
                        quxian = "察右中旗";
                        break;
                    case "丰镇" :
                        quxian = "丰镇市";
                        break;
                    case "化德" :
                        quxian = "化德县";
                        break;
                    case "集宁区（非个体）" :
                    case "集宁区个体" :
                    case "集宁区所有工商所" :
                        quxian = "集宁区";
                        break;
                    case "凉城" :
                        quxian = "凉城县";
                        break;
                    case "商都" :
                        quxian = "商都县";
                        break;
                    case "四子王旗" :
                        quxian = "四子王旗";
                        break;
                    case "乌兰察布市市场局" :
                        quxian = "乌兰察布市";
                        break;
                    case "兴和" :
                        quxian = "兴和县";
                        break;
                    case "卓资" :
                        quxian = "卓资县";
                        break;
                    default : //可选
                        quxian = quxian;
                        break;
                }

                //先FileReader把文件读出来再bufferReader按行读  reader.readLine(); 没有标题用不着了
                DataInputStream in = new DataInputStream(new FileInputStream(listFile));
                BufferedReader reader= new BufferedReader(new InputStreamReader(in,"gb2312"));

                String line = null;
                int index = 0;
                int rows = 0;

                StringBuffer stringBuffer = new StringBuffer();
                StringBuffer sg = new StringBuffer();

                while ((line = reader.readLine()) != null) {
                    String item[] = line.split(",");//一行数组
                    if (index > 2) {//？
                        if (item.length >= col - 1) {
                            String last = null;
                            try {
                                last = item[col - 1];//这里

                                if (StringUtils.isNotBlank(last.trim())){
                                    String s = StringUtils.replaceWhitespaceCharacters(last,"");
                                    if (result.contains(s)){

                                        String name11 = StringUtils.replaceWhitespaceCharacters(readrowcol(index,4,listFile),"");

                                        stringBuffer.append("update tbl_csrrg_corporate SET quxian='"+quxian).append("' where registered_number='").append(s).append("';\n");

                                        rows++;
                                    }
                                }
                            }catch (Exception e){
//                                System.out.println(listFile.getName());
//                                System.out.println(JSON.toJSONString(item));
                            }
                        }
                    }
                    index++;
                }

                System.out.println(stringBuffer.toString());
                ii = ii + rows;
                in.close();
                reader.close();

            }

            System.out.println(ii);
        } catch (Exception e) {
            //在命令行打印异常信息在程序中出错的位置及原因。
            e.printStackTrace();
        }


    }

    private static String readrowcol(int row, int col,File file) {


        try {
            //先FileReader把文件读出来再bufferReader按行读  reader.readLine(); 没有标题用不着了
            DataInputStream in = new DataInputStream(new FileInputStream(file));
            BufferedReader reader= new BufferedReader(new InputStreamReader(in,"GBK"));

            String line = null;
            int index = 0;
            int rows = 0;

            StringBuffer stringBuffer = new StringBuffer();

            while ((line = reader.readLine()) != null) {
                String item[] = line.split(",");//一行数组
                if (index == row) {//？
                    return item[col-1];
                }
                index++;
            }

            in.close();
            reader.close();
        } catch (Exception e) {
            //在命令行打印异常信息在程序中出错的位置及原因。
            e.printStackTrace();
        }

        return null;
    }


}
